Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СведенияОСотрудниках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СведенияОСотрудниках</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Сотрудники/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВосстановитьЗначенияРеквизитовФормы();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	НоваяЗапись = РегистрыСведений.СведенияОСотрудниках.СоздатьМенеджерЗаписи();
	
	НоваяЗапись.Период = ТекущаяДата();
	НоваяЗапись.Сотрудник = Объект.Ссылка;
	НоваяЗапись.Подразделение = ТекущееПодразделение;
	НоваяЗапись.Оклад = ТекущаяТарифнаяСтавка; 
	НоваяЗапись.Записать(Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	СохранитьЗначенияРеквизитовФормы();
КонецПроцедуры


#Область РаботаСРеквизитамиФормы

&НаСервере
Процедура СохранитьЗначенияРеквизитовФормы()
	Если Не Объект.Ссылка.Пустая() Тогда
		Настройки = Новый Соответствие;
		Настройки.Вставить("ДатаПриема", ДатаПриема);
		Настройки.Вставить("ДатаУвольнения", ДатаУвольнения);
		Настройки.Вставить("ТекущееПодразделение", ТекущееПодразделение);
		Настройки.Вставить("ТекущаяДолжность", ТекущаяДолжность);
		Настройки.Вставить("ТекущийВидЗанятости", ТекущийВидЗанятости);
		Настройки.Вставить("ТекущаяТарифнаяСтавка", ТекущаяТарифнаяСтавка);
		
		СерверныеПроцедуры.СохранитьЗначенияРеквизитов(Объект.Ссылка, Настройки);  
	КонецЕсли;
КонецПроцедуры 


&НаСервере
Процедура ВосстановитьЗначенияРеквизитовФормы()  
	ЗначениеРеквизитов = СерверныеПроцедуры.ВосстановитьЗначенияРеквизитов(Объект.Ссылка);
	
	Если ТипЗнч(ЗначениеРеквизитов) = Тип("Соответствие") Тогда
		ДатаПриема = ЗначениеРеквизитов.Получить("ДатаПриема");
		ДатаУвольнения = ЗначениеРеквизитов.Получить("ДатаУвольнения");
		ТекущееПодразделение = ЗначениеРеквизитов.Получить("ТекущееПодразделение");
		ТекущаяДолжность = ЗначениеРеквизитов.Получить("ТекущаяДолжность");
		ТекущийВидЗанятости = ЗначениеРеквизитов.Получить("ТекущийВидЗанятости");
		ТекущаяТарифнаяСтавка = ЗначениеРеквизитов.Получить("ТекущаяТарифнаяСтавка");
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	Объект.Наименование = Элемент.ВыделенныйТекст;
КонецПроцедуры


&НаКлиенте
Процедура НадписьИсторияФИОНажатие(Элемент)
	Отбор = Новый Структура("ФизическоеЛицо", Объект.ФизическоеЛицо);
	ОткрытьФорму("РегистрСведений.ФИОФизическихЛиц.ФормаСписка", Новый Структура("Отбор", Отбор)); 
КонецПроцедуры
